constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       1530;
    }
    ceiling
    {
        type            wall;
        inGroups        1(wall);
        nFaces          43;
        startFace       1570;
    }
    sWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          18;
        startFace       1613;
    }
    nWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       1631;
    }
    sideWalls
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1592;
        startFace       1651;
    }
    inlet
    {
        type            patch;
        nFaces          1;
        startFace       3243;
    }
    outlet
    {
        type            patch;
        nFaces          2;
        startFace       3244;
    }
)

// ************************************************************************* //
