0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    floor
    {
        type            wallHeatTransfer;
        Tinf            uniform 301;  // 外部温度
        alphaWall       uniform 0.36;  // 熱伝達係数
        value           uniform 300;
        
        //type            zeroGradient;
    }
    ceiling
    {
        type            wallHeatTransfer;
        Tinf            uniform 301;  // 外部温度
        alphaWall       uniform 0.36;  // 熱伝達係数
        value           uniform 300;
        
        //type            zeroGradient;
    }
    nWall
    {
        type            wallHeatTransfer;
        Tinf            uniform 305.6;
        alphaWall       uniform 0.54;
        value           uniform 300;
        
        //type            zeroGradient;
    }
    sWall
    {
        type            wallHeatTransfer;
        Tinf            uniform 313.2;
        alphaWall       uniform 0.54;
        value           uniform 300; 
    } 
    sideWalls
    {
        type            empty;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 298.15;
    }
}

// ************************************************************************* //
